declare module y3.Const
{
    const enum CursorState
    {
        ['常态悬浮'] = '常态悬浮',
        ['常态选取'] = '常态选取',
        ['常态禁用'] = '常态禁用',
        ['敌方建筑单位悬浮'] = '敌方建筑单位悬浮',
        ['敌方非建筑单位悬浮'] = '敌方非建筑单位悬浮',
        ['敌方建筑单位选取'] = '敌方建筑单位选取',
        ['敌方非建筑单位选取'] = '敌方非建筑单位选取',
        ['己方建筑单位悬浮'] = '己方建筑单位悬浮',
        ['己方非建筑单位悬浮'] = '己方非建筑单位悬浮',
        ['己方建筑单位选取'] = '己方建筑单位选取',
        ['己方非建筑单位选取'] = '己方非建筑单位选取',
        ['友方建筑单位悬浮'] = '友方建筑单位悬浮',
        ['友方非建筑单位悬浮'] = '友方非建筑单位悬浮',
        ['友方建筑单位选取'] = '友方建筑单位选取',
        ['友方非建筑单位选取'] = '友方非建筑单位选取',
    }
}