declare module y3.Const
{
    const enum KeyboardKey
    {
        /**
         *
         * */
        ['NONE'] = 0x00,
        /**
         * ESC
         * */
        ['ESCAPE'] = 0x01,
        /**
         * 1
         * */
        ['KEY_1'] = 0x02,
        /**
         * 2
         * */
        ['KEY_2'] = 0x03,
        /**
         * 3
         * */
        ['KEY_3'] = 0x04,
        /**
         * 4
         * */
        ['KEY_4'] = 0x05,
        /**
         * 5
         * */
        ['KEY_5'] = 0x06,
        /**
         * 6
         * */
        ['KEY_6'] = 0x07,
        /**
         * 7
         * */
        ['KEY_7'] = 0x08,
        /**
         * 8
         * */
        ['KEY_8'] = 0x09,
        /**
         * 9
         * */
        ['KEY_9'] = 0x0A,
        /**
         * 0
         * */
        ['KEY_0'] = 0x0B,
        /**
         * -
         * */
        ['MINUS'] = 0x0C,
        /**
         * =
         * */
        ['EQUAL'] = 0x0D,
        /**
         * Backspace
         * */
        ['BACKSPACE'] = 0x0E,
        /**
         * Tab
         * */
        ['TAB'] = 0x0F,
        /**
         * Q
         * */
        ['Q'] = 0x10,
        /**
         * W
         * */
        ['W'] = 0x11,
        /**
         * E
         * */
        ['E'] = 0x12,
        /**
         * R
         * */
        ['R'] = 0x13,
        /**
         * T
         * */
        ['T'] = 0x14,
        /**
         * Y
         * */
        ['Y'] = 0x15,
        /**
         * U
         * */
        ['U'] = 0x16,
        /**
         * I
         * */
        ['I'] = 0x17,
        /**
         * O
         * */
        ['O'] = 0x18,
        /**
         * P
         * */
        ['P'] = 0x19,
        /**
         * [
         * */
        ['LBRACKET'] = 0x1A,
        /**
         * ]
         * */
        ['RBRACKET'] = 0x1B,
        /**
         * Enter
         * */
        ['RETURN'] = 0x1C,
        /**
         * 左Ctrl
         * */
        ['LCTRL'] = 0x1D,
        /**
         * A
         * */
        ['A'] = 0x1E,
        /**
         * S
         * */
        ['S'] = 0x1F,
        /**
         * D
         * */
        ['D'] = 0x20,
        /**
         * F
         * */
        ['F'] = 0x21,
        /**
         * G
         * */
        ['G'] = 0x22,
        /**
         * H
         * */
        ['H'] = 0x23,
        /**
         * J
         * */
        ['J'] = 0x24,
        /**
         * K
         * */
        ['K'] = 0x25,
        /**
         * L
         * */
        ['L'] = 0x26,
        /**
         * ;
         * */
        ['SEMICOLON'] = 0x27,
        /**
         * '
         * */
        ['APOSTROPHE'] = 0x28,
        /**
         * `
         * */
        ['GRAVE'] = 0x29,
        /**
         * 左Shift
         * */
        ['LSHIFT'] = 0x2A,
        /**
         * \
         * */
        ['BACKSLASH'] = 0x2B,
        /**
         * Z
         * */
        ['Z'] = 0x2C,
        /**
         * X
         * */
        ['X'] = 0x2D,
        /**
         * C
         * */
        ['C'] = 0x2E,
        /**
         * V
         * */
        ['V'] = 0x2F,
        /**
         * B
         * */
        ['B'] = 0x30,
        /**
         * N
         * */
        ['N'] = 0x31,
        /**
         * M
         * */
        ['M'] = 0x32,
        /**
         * ,
         * */
        ['COMMA'] = 0x33,
        /**
         * .
         * */
        ['PERIOD'] = 0x34,
        /**
         * /
         * */
        ['SLASH'] = 0x35,
        /**
         * 右Shift
         * */
        ['RSHIFT'] = 0x36,
        /**
         * 小键盘*
         * */
        ['NUM_STAR'] = 0x37,
        /**
         * 左Alt
         * */
        ['LALT'] = 0x38,
        /**
         * Space
         * */
        ['SPACE'] = 0x39,
        /**
         * CAPSLOCK
         * */
        ['CAPSLOCK'] = 0x3A,
        /**
         * F1
         * */
        ['F1'] = 0x3B,
        /**
         * F2
         * */
        ['F2'] = 0x3C,
        /**
         * F3
         * */
        ['F3'] = 0x3D,
        /**
         * F4
         * */
        ['F4'] = 0x3E,
        /**
         * F5
         * */
        ['F5'] = 0x3F,
        /**
         * F6
         * */
        ['F6'] = 0x40,
        /**
         * F7
         * */
        ['F7'] = 0x41,
        /**
         * F8
         * */
        ['F8'] = 0x42,
        /**
         * F9
         * */
        ['F9'] = 0x43,
        /**
         * F10
         * */
        ['F10'] = 0x44,
        /**
         * Pause
         * */
        ['PAUSE'] = 0x45,
        /**
         * Scroll Lock
         * */
        ['SCROLL_LOCK'] = 0x46,
        /**
         * 小键盘7
         * */
        ['NUM_7'] = 0x47,
        /**
         * 小键盘8
         * */
        ['NUM_8'] = 0x48,
        /**
         * 小键盘9
         * */
        ['NUM_9'] = 0x49,
        /**
         * 小键盘-
         * */
        ['NUM_MINUS'] = 0x4A,
        /**
         * 小键盘4
         * */
        ['NUM_4'] = 0x4B,
        /**
         * 小键盘5
         * */
        ['NUM_5'] = 0x4C,
        /**
         * 小键盘6
         * */
        ['NUM_6'] = 0x4D,
        /**
         * 小键盘+
         * */
        ['NUM_ADD'] = 0x4E,
        /**
         * 小键盘1
         * */
        ['NUM_1'] = 0x4F,
        /**
         * 小键盘2
         * */
        ['NUM_2'] = 0x50,
        /**
         * 小键盘3
         * */
        ['NUM_3'] = 0x51,
        /**
         * 小键盘0
         * */
        ['NUM_0'] = 0x52,
        /**
         * 小键盘.
         * */
        ['NUM_PERIOD'] = 0x53,
        /**
         * F11
         * */
        ['F11'] = 0x57,
        /**
         * F12
         * */
        ['F12'] = 0x58,
        /**
         * 小键盘Enter
         * */
        ['NUM_ENTER'] = 0x9C,
        /**
         * 右Ctrl
         * */
        ['RCTRL'] = 0x9D,
        /**
         * 小键盘,
         * */
        ['NUM_COMMA'] = 0xB3,
        /**
         * 小键盘/
         * */
        ['NUM_SLASH'] = 0xB5,
        /**
         * 系统重启
         * */
        ['SYSRQ'] = 0xB7,
        /**
         * 右Alt
         * */
        ['R_ALT'] = 0xB8,
        /**
         * NumLock
         * */
        ['NUM_LOCK'] = 0xC5,
        /**
         * Home
         * */
        ['HOME'] = 0xC7,
        /**
         * ↑
         * */
        ['UPARROW'] = 0xC8,
        /**
         * PageUp
         * */
        ['PAGEUP'] = 0xC9,
        /**
         * ←
         * */
        ['LEFTARROW'] = 0xCB,
        /**
         * →
         * */
        ['RIGHTARROW'] = 0xCD,
        /**
         * End
         * */
        ['END'] = 0xCF,
        /**
         * ↓
         * */
        ['DOWNARROW'] = 0xD0,
        /**
         * PageDown
         * */
        ['PAGEDOWN'] = 0xD1,
        /**
         * Insert
         * */
        ['INSERT'] = 0xD2,
        /**
         * Delete
         * */
        ['DELETE'] = 0xD3,
        /**
         * 左Win
         * */
        ['LWIN'] = 0xDB,
        /**
         * 右Win
         * */
        ['RWIN'] = 0xDC,
        /**
         * 应用
         * */
        ['APPS'] = 0xDD,
    }
}